def main():
    """
    3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится
    месяц (зима, весна, лето, осень). Напишите решения через list и через dict.
    """
    seasons_list = [
        (1, "Зима"), (2, "Зима"), (12, "Зима"),
        (3, "Весна"), (4, "Весна"), (5, "Весна"),
        (6, "Лето"), (7, "Лето"), (8, "Лето"),
        (9, "Осень"), (10, "Осень"), (11, "Осень"),
    ]

    seasons_dict = {
        1: "Зима", 2: "Зима", 12: "Зима",
        3: "Весна", 4: "Весна", 5: "Весна",
        6: "Лето", 7: "Лето", 8: "Лето",
        9: "Осень", 10: "Осень", 11: "Осень"
    }

    number = int(input("Введите месяц: "))

    print(seasons_dict[number])

    for month, season in seasons_list:
        if month == number:
            print(season)


if __name__ == '__main__':
    main()
